0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2412                                  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.001;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.001;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.001;
    }
    deflector
    {
        type epsilonWallFunction;  // for epsilon
        value           uniform 1e-5;

    }
}
