constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1e-5;
