constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

// simulationType  RAS;
simulationType  laminar;

// RAS
// {
//     RASModel        kEpsilon;
//     turbulence      on;
//     printCoeffs     on;
// }
