system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-0.5 -0.5 -0.5) // 0
    ( 0.5 -0.5 -0.5) // 1
    ( 0.5  0.5 -0.5) // 2
    (-0.5  0.5 -0.5) // 3
    (-0.5 -0.5  0.5) // 4
    ( 0.5 -0.5  0.5) // 5
    ( 0.5  0.5  0.5) // 6
    (-0.5  0.5  0.5) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 80 80) simpleGrading (1 1 1)
);

edges        ();
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
mergePatchPairs ();
